coinduction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-25 Sat 21:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Coinduction</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="index.html">Cosmoi</a>
</div>
<div id="navigation">
<a href="index.html">Index</a>
<a href="about.html">About</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Coinduction</h1>
<p>
The following article by Jacobs and Rutten is a really nice
introduction to the notion of coinduction.  It assumes almost no prior
knowledge of categories and details algebras, initiality, coalgebras,
finality, induction and bisimulation.
</p>

<ul class="org-ul">
<li><a href="http://www.cs.ru.nl/~bart/PAPERS/JR.pdf">A tutorial on (Co)algebras and (Co)induction - Bart Jacobs, Jan Rutten</a></li>
</ul>

<p>
Conatural numbers can be implemented in Agda using <a href="https://agda.readthedocs.io/en/v2.5.4.1/language/coinduction.html#coinduction">coinductive records</a>
as in the following example.  If you are interested in understanding
coinduction, it might be a good idea to experiment in Agda; I learnt a
lot writing basic coinductive definitions.
</p>

<div class="org-src-container">
<pre class="src src-agda">data Maybe (A : Set) : Set where
  Nothing : Maybe A
  Just : A → Maybe A

record coNat : Set where
  coinductive
  field
    pred : Maybe coNat
open coNat public    

coZero : coNat
pred coZero = Nothing

coInf : coNat
pred coInf = Just coInf

succ : coNat → coNat
pred (succ n) = Just n

infixl 20 _+_
_+_ : coNat → coNat → coNat
pred (a + b) with pred a
pred (a + b) | Nothing = pred b
pred (a + b) | Just a' = Just (a' + b)
</pre>
</div>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 2018-08-15 Wed 23:08. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
